_posts/2022-01-15-boj-4256.html
---
title: BOJ 4256 트리
tags: 분할정복 Tree
toc: true
toc_sticky: true
---

<div id="outline-container-org746e4a8" class="outline-2">
<h2 id="org746e4a8">BOJ 4256 트리</h2>
</div>

<div id="outline-container-org137f7fb" class="outline-2">
<h2 id="org137f7fb">접근하기</h2>
<div class="outline-text-2" id="text-org137f7fb">
<pre class="example">
분할정복으로 접근해야 하는 문제

전위 순회 3,6,5,4,8,7,1,2   
    --&gt; 맨 앞이 root node
    --&gt; 중위순회에에서 왼쪽 subtree의 노드수 4를 이용하면
    --&gt; 3  ,6,5,4,8,  7,1,2   

    --&gt; root = 0번 index
    --&gt; 왼쪽 subtree 시작위치 1  == root + 1   -&gt; 값
    --&gt; 오른쪽 subtree 시작위치 5 == root + 4 - 0 + 1
    --&gt; 4값은 중위순회에서 얻음    

중위 순회 5,6,8,4,3,1,2,7  
    --&gt; 한가운데가 root node -&gt; 왼쪽 sub tree, 오른쪽 sub tree로 나눌 수 있음
    --&gt; 3이 root, 왼쪽 subtree가 4개, 오른쪽 subtree가 3개의 노드가 있음

후위 순회 5,8,4,6,2,1,7,3

</pre>
</div>
</div>

<div id="outline-container-org3865340" class="outline-2">
<h2 id="org3865340">코드</h2>
<div class="outline-text-2" id="text-org3865340">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">T</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">pre</span>[1010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">in</span>[1010];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">root</span>)
{
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=s;i&lt;e;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (in[i] == pre[root]) {
            f(s, i, root + 1);
            f(i+1, e, root + (i-s) + 1);
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, pre[root]);
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">solve</span>()
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;pre[i]); 
    }
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;in[i]); 
    }

    f(0, N, 0);
    printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;T);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">tc</span>=1;tc&lt;=T;tc++) {
        solve();
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org15fe637" class="outline-2">
<h2 id="org15fe637">문제 링크</h2>
<div class="outline-text-2" id="text-org15fe637">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/4256">https://www.acmicpc.net/problem/4256</a></li>
</ul>
</div>
</div>
